IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_adc_result_regs.xml
<module id="ADC_RESULT_REGS" HW_revision="" description="ADC RESULT Registers">
	<register id="ADCRESULT0" width="16" page="1" offset="0x0" internal="0" description="ADC Result 0 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT1" width="16" page="1" offset="0x1" internal="0" description="ADC Result 1 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT2" width="16" page="1" offset="0x2" internal="0" description="ADC Result 2 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT3" width="16" page="1" offset="0x3" internal="0" description="ADC Result 3 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT4" width="16" page="1" offset="0x4" internal="0" description="ADC Result 4 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT5" width="16" page="1" offset="0x5" internal="0" description="ADC Result 5 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT6" width="16" page="1" offset="0x6" internal="0" description="ADC Result 6 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT7" width="16" page="1" offset="0x7" internal="0" description="ADC Result 7 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT8" width="16" page="1" offset="0x8" internal="0" description="ADC Result 8 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT9" width="16" page="1" offset="0x9" internal="0" description="ADC Result 9 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT10" width="16" page="1" offset="0xa" internal="0" description="ADC Result 10 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT11" width="16" page="1" offset="0xb" internal="0" description="ADC Result 11 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT12" width="16" page="1" offset="0xc" internal="0" description="ADC Result 12 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT13" width="16" page="1" offset="0xd" internal="0" description="ADC Result 13 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT14" width="16" page="1" offset="0xe" internal="0" description="ADC Result 14 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT15" width="16" page="1" offset="0xf" internal="0" description="ADC Result 15 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB1RESULT" width="32" page="1" offset="0x10" internal="0" description="ADC Post Processing Block 1 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB2RESULT" width="32" page="1" offset="0x12" internal="0" description="ADC Post Processing Block 2 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB3RESULT" width="32" page="1" offset="0x14" internal="0" description="ADC Post Processing Block 3 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB4RESULT" width="32" page="1" offset="0x16" internal="0" description="ADC Post Processing Block 4 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB1SUM" width="32" page="1" offset="0x18" internal="0" description="ADC PPB 1 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 1 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB1COUNT" width="16" page="1" offset="0x1a" internal="0" description="ADC PPB1 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 1 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2SUM" width="32" page="1" offset="0x1c" internal="0" description="ADC PPB 2 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 2 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB2COUNT" width="16" page="1" offset="0x1e" internal="0" description="ADC PPB2 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 2 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3SUM" width="32" page="1" offset="0x20" internal="0" description="ADC PPB 3 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 3 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB3COUNT" width="16" page="1" offset="0x22" internal="0" description="ADC PPB3 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 3 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4SUM" width="32" page="1" offset="0x24" internal="0" description="ADC PPB 4 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 4 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB4COUNT" width="16" page="1" offset="0x26" internal="0" description="ADC PPB4 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 4 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MAX" width="32" page="1" offset="0x28" internal="0" description="ADC PPB 1 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 1 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MAXI" width="16" page="1" offset="0x2a" internal="0" description="ADC PPB 1 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 1 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MIN" width="32" page="1" offset="0x2c" internal="0" description="ADC PPB 1 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 1 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MINI" width="16" page="1" offset="0x2e" internal="0" description="ADC PPB 1 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 1 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MAX" width="32" page="1" offset="0x30" internal="0" description="ADC PPB 2 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 2 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MAXI" width="16" page="1" offset="0x32" internal="0" description="ADC PPB 2 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 2 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MIN" width="32" page="1" offset="0x34" internal="0" description="ADC PPB 2 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 2 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MINI" width="16" page="1" offset="0x36" internal="0" description="ADC PPB 2 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 2 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MAX" width="32" page="1" offset="0x38" internal="0" description="ADC PPB 3 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 3 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MAXI" width="16" page="1" offset="0x3a" internal="0" description="ADC PPB 3 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 3 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MIN" width="32" page="1" offset="0x3c" internal="0" description="ADC PPB 3 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 3 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MINI" width="16" page="1" offset="0x3e" internal="0" description="ADC PPB 3 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 3 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MAX" width="32" page="1" offset="0x40" internal="0" description="ADC PPB 4 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 4 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MAXI" width="16" page="1" offset="0x42" internal="0" description="ADC PPB 4 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 4 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MIN" width="32" page="1" offset="0x44" internal="0" description="ADC PPB 4 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 4 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MINI" width="16" page="1" offset="0x46" internal="0" description="ADC PPB 4 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 4 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
</module>
